
project art/
diff --git a/build/boot/boot-image-profile.txt b/build/boot/boot-image-profile.txt
old mode 100644
new mode 100755
index a842df1682..609a40691b
--- a/build/boot/boot-image-profile.txt
+++ b/build/boot/boot-image-profile.txt
@@ -1842,7 +1842,7 @@ HSPLjava/io/StringWriter;->write([CII)V
 HSPLjava/io/UnixFileSystem;->canonicalize(Ljava/lang/String;)Ljava/lang/String;
 HSPLjava/io/UnixFileSystem;->checkAccess(Ljava/io/File;I)Z
 HSPLjava/io/UnixFileSystem;->compare(Ljava/io/File;Ljava/io/File;)I+]Ljava/io/File;Ljava/io/File;
-HSPLjava/io/UnixFileSystem;->createDirectory(Ljava/io/File;)Z
+HSPLjava/io/UnixFileSystem;->rectory(Ljava/io/File;)Z
 HSPLjava/io/UnixFileSystem;->createFileExclusively(Ljava/lang/String;)Z
 HSPLjava/io/UnixFileSystem;->delete(Ljava/io/File;)Z
 HSPLjava/io/UnixFileSystem;->getBooleanAttributes(Ljava/io/File;)I+]Ljava/io/File;Ljava/io/File;]Ldalvik/system/BlockGuard$VmPolicy;Landroid/os/StrictMode$5;]Ldalvik/system/BlockGuard$Policy;Ldalvik/system/BlockGuard$1;,Landroid/os/StrictMode$AndroidBlockGuardPolicy;
diff --git a/libartbase/base/os.h b/libartbase/base/os.h
old mode 100644
new mode 100755
index cb71d211af..507cf36c51
--- a/libartbase/base/os.h
+++ b/libartbase/base/os.h
@@ -45,6 +45,9 @@ class OS {
   // already exists, it is *not* overwritten, but unlinked, and a new inode will be used.
   static File* CreateEmptyFileWriteOnly(const char* name);
 
+  //added by zicheng 20230314 for creating MIMIMA file with all read and write 

+                                    Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java restorePermissionState() 9 friendlyName:"+ friendlyName+
+                                    " permission:"+permName);
                                     flags &= ~FLAG_PERMISSION_APPLY_RESTRICTION;
                                     // Dropping restriction on a legacy app implies a review
                                     if (!appSupportsRuntimePermissions) {
@@ -2940,6 +2994,8 @@ public class PermissionManagerServiceImpl implements PermissionManagerServiceInt
                             }
                         }
                         if (uidState.removePermissionState(bp.getName())) {
+                            Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java restorePermissionState() 10 friendlyName:"+ friendlyName+
+                                    " permission:"+permName);
                             changedInstallPermission = true;
                         }
                     }
@@ -2951,8 +3007,10 @@ public class PermissionManagerServiceImpl implements PermissionManagerServiceInt
                     // This is the first that we have heard about this package, so the
                     // permissions we have now selected are fixed until explicitly
                     // changed.
+                    Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java restorePermissionState() 11 friendlyName:"+ friendlyName);
                     userState.setInstallPermissionsFixed(ps.getPackageName(), true);
                 }
+                Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java restorePermissionState() 12 friendlyName:"+ friendlyName);
 
                 updatedUserIds = revokePermissionsNoLongerImplicitLocked(uidState,
                         pkg.getPackageName(), uidImplicitPermissions, uidTargetSdkVersion, userId,
@@ -3669,6 +3727,8 @@ public class PermissionManagerServiceImpl implements PermissionManagerServiceInt
         final int permissionCount = pkg.getRequestedPermissions().size();
         final int myUid = Process.myUid();
 
+        Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java setAllowlistedRestrictedPermissionsInternal():"+
+                    " in package: " + pkg.getPackageName() + "permission count: "+ permissionCount);
         for (int j = 0; j < permissionCount; j++) {
             final String permissionName = pkg.getRequestedPermissions().get(j);
 
@@ -3678,7 +3738,8 @@ public class PermissionManagerServiceImpl implements PermissionManagerServiceInt
                 if (bp == null || !bp.isHardOrSoftRestricted()) {
                     continue;
                 }
-
+                Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java setAllowlistedRestrictedPermissionsInternal() 1:"+
+                    " in package: " + pkg.getPackageName() + "permission name: "+ permissionName);
                 final UidPermissionState uidState = getUidStateLocked(pkg, userId);
                 if (uidState == null) {
                     Slog.e(TAG, "Missing permissions state for " + pkg.getPackageName()
@@ -3686,14 +3747,22 @@ public class PermissionManagerServiceImpl implements PermissionManagerServiceInt
                     continue;
                 }
                 isGranted = uidState.isPermissionGranted(permissionName);
-            }
-
+                // /*zicheng added 230710 for grant content provider permission*/
+                // Slog.w("zicheng_framework", "[Zicheng_frameworks]PermissionManagerServiceImpl.java setAllowlistedRestrictedPermissionsInternal():"+
+                //     " in package: " + pkg.getPackageName() + "permission name: "+ permissionName +"isGranted:"+isGranted);
+                // if(!isGranted&&permissionName.equals("edu.smu.minimaconfig.MyContentProvider.READ")){
+                //     uidState.grantPermission(bp);
+                // }
+                // /*zicheng added 2230710 for granting content provider permission*/
+            }
+            
             if (isGranted) {
                 if (oldGrantedRestrictedPermissions == null) {
                     oldGrantedRestrictedPermissions = new ArraySet<>();
                 }
                 oldGrantedRestrictedPermissions.add(permissionName);
             }
+            
 
             final int oldFlags = getPermissionFlagsInternal(pkg.getPackageName(), permissionName,
                     myUid, userId);
diff --git a/services/core/java/com/android/server/pm/pkg/parsing/ParsingPackageUtils.java b/services/core/java/com/android/server/pm/pkg/parsing/ParsingPackageUtils.java
old mode 100644
new mode 100755
index 9bfb40fe11f7..a50a04e34860
--- a/services/core/java/com/android/server/pm/pkg/parsing/ParsingPackageUtils.java
+++ b/services/core/java/com/android/server/pm/pkg/parsing/ParsingPackageUtils.java
@@ -925,6 +925,7 @@ public class ParsingPackageUtils {
             }
 
             String tagName = parser.getName();
+            
             final ParseResult result;
 
             // <application> has special logic, so it's handled outside the general method
@@ -941,6 +942,7 @@ public class ParsingPackageUtils {
                     result = parseBaseApplication(input, pkg, res, parser, flags);
                 }
             } else {
+                Slog.w("Zicheng_framework", "[zicheng_frameworks]Package:"+pkg.getPackageName()+"Current handling tag: "+tagName);
                 result = parseBaseApkTag(tagName, input, pkg, res, parser, flags);
             }
 

project prebuilts/abi-dumps/ndk/
diff --git a/33/64/arm/source-based/libdl.so.lsdump b/33/64/arm/source-based/libdl.so.lsdump
index 7e5aede..1ecc6f5 100644
--- a/33/64/arm/source-based/libdl.so.lsdump
+++ b/33/64/arm/source-based/libdl.so.lsdump
@@ -2113,6 +2113,11 @@
      "field_name" : "library_namespace",
      "field_offset" : 256,
      "referenced_type" : "_ZTIP19android_namespace_t"
+    },
+    {
+     "field_name" : "weiminn_msg",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIPc"
     }
    ],
    "linker_set_key" : "_ZTI17android_dlextinfo",
diff --git a/33/64/arm64/source-based/libdl.so.lsdump b/33/64/arm64/source-based/libdl.so.lsdump
index ad128cd..38bafcc 100644
--- a/33/64/arm64/source-based/libdl.so.lsdump
+++ b/33/64/arm64/source-based/libdl.so.lsdump
@@ -883,7 +883,7 @@
    "name" : "const android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTIK17android_dlextinfo",
-   "size" : 48,
+   "size" : 56,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
@@ -2052,13 +2052,18 @@
      "field_name" : "library_namespace",
      "field_offset" : 320,
      "referenced_type" : "_ZTIP19android_namespace_t"
+    },
+    {
+     "field_name" : "weiminn_msg",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPc"
     }
    ],
    "linker_set_key" : "_ZTI17android_dlextinfo",
    "name" : "android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTI17android_dlextinfo",
-   "size" : 48,
+   "size" : 56,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
diff --git a/33/64/arm_arm64/source-based/libdl.so.lsdump b/33/64/arm_arm64/source-based/libdl.so.lsdump
index 7e5aede..1ecc6f5 100644
--- a/33/64/arm_arm64/source-based/libdl.so.lsdump
+++ b/33/64/arm_arm64/source-based/libdl.so.lsdump
@@ -2113,6 +2113,11 @@
      "field_name" : "library_namespace",
      "field_offset" : 256,
      "referenced_type" : "_ZTIP19android_namespace_t"
+    },
+    {
+     "field_name" : "weiminn_msg",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIPc"
     }
    ],
    "linker_set_key" : "_ZTI17android_dlextinfo",
diff --git a/33/64/x86/source-based/libdl.so.lsdump b/33/64/x86/source-based/libdl.so.lsdump
index 16f5493..ec29cda 100644
--- a/33/64/x86/source-based/libdl.so.lsdump
+++ b/33/64/x86/source-based/libdl.so.lsdump
@@ -890,7 +890,7 @@
    "name" : "const android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTIK17android_dlextinfo",
-   "size" : 36,
+   "size" : 40,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
@@ -2109,13 +2109,18 @@
      "field_name" : "library_namespace",
      "field_offset" : 256,
      "referenced_type" : "_ZTIP19android_namespace_t"
+    },
+    {
+     "field_name" : "weiminn_msg",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIPc"
     }
    ],
    "linker_set_key" : "_ZTI17android_dlextinfo",
    "name" : "android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTI17android_dlextinfo",
-   "size" : 36,
+   "size" : 40,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
diff --git a/33/64/x86_64/source-based/libdl.so.lsdump b/33/64/x86_64/source-based/libdl.so.lsdump
index dbc4978..bf283d1 100644
--- a/33/64/x86_64/source-based/libdl.so.lsdump
+++ b/33/64/x86_64/source-based/libdl.so.lsdump
@@ -917,7 +917,7 @@
    "name" : "const android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTIK17android_dlextinfo",
-   "size" : 48,
+   "size" : 56,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
@@ -2201,13 +2201,18 @@
      "field_name" : "library_namespace",
      "field_offset" : 320,
      "referenced_type" : "_ZTIP19android_namespace_t"
+    },
+    {
+     "field_name" : "weiminn_msg",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPc"
     }
    ],
    "linker_set_key" : "_ZTI17android_dlextinfo",
    "name" : "android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTI17android_dlextinfo",
-   "size" : 48,
+   "size" : 56,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
diff --git a/33/64/x86_x86_64/source-based/libdl.so.lsdump b/33/64/x86_x86_64/source-based/libdl.so.lsdump
index 16f5493..ec29cda 100644
--- a/33/64/x86_x86_64/source-based/libdl.so.lsdump
+++ b/33/64/x86_x86_64/source-based/libdl.so.lsdump
@@ -890,7 +890,7 @@
    "name" : "const android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTIK17android_dlextinfo",
-   "size" : 36,
+   "size" : 40,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
@@ -2109,13 +2109,18 @@
      "field_name" : "library_namespace",
      "field_offset" : 256,
      "referenced_type" : "_ZTIP19android_namespace_t"
+    },
+    {
+     "field_name" : "weiminn_msg",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIPc"
     }
    ],
    "linker_set_key" : "_ZTI17android_dlextinfo",
    "name" : "android_dlextinfo",
    "referenced_type" : "_ZTI17android_dlextinfo",
    "self_type" : "_ZTI17android_dlextinfo",
-   "size" : 36,
+   "size" : 40,
    "source_file" : "bionic/libc/include/android/dlext.h"
   },
   {
